app/controllers/cadastros_controller.rb

	def create
		valores = params.require(:cadastro).permit :nome, :rg, :cpf, :veiculo, :cidade, :telefone, :image
		@cadastro = Cadastro.new valores
		if @cadastro.save
---
INSERT INTO "cadastros" ("nome", "rg", "cpf", "veiculo", "cidade", "telefone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def edit
		id = params[:id]
		@cadastro = Cadastro.find id
---
SELECT  "cadastros".* FROM "cadastros" WHERE "cadastros"."id" = ? LIMIT 1  [["id", 3]]

	def update
		id = params[:id]
		@cadastro = Cadastro.find id
		@veiculos = ["LS", "BiTrem", "RodoTrem", "Simples", "Vanderleia"]
		valores = params.require(:cadastro).permit :nome, :rg, :cpf, :veiculo, :cidade, :telefone, :image
		@cadastro.update valores
---
SELECT  "cadastros".* FROM "cadastros" WHERE "cadastros"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "cadastros" SET "image" = ?, "updated_at" = ? WHERE "cadastros"."id" = ?  [["image", "http://www.guls.com.br/blog/wp-content/uploads/2014/05/Captura-de-tela-de-2014-05-07-00.47.47.png"], ["updated_at", "2016-12-19 17:13:58.424614"], ["id", 6]]

	def detalhes
		id = params[:id]
		@cadastro = Cadastro.find id
---
SELECT  "cadastros".* FROM "cadastros" WHERE "cadastros"."id" = ? LIMIT 1  [["id", 3]]

	def all
		@cadastros = Cadastro.all
---
SELECT "cadastros".* FROM "cadastros"

	def destroy
		Cadastro.destroy params[:id]
---
DELETE FROM "cadastros" WHERE "cadastros"."id" = ?  [["id", 1]]

	def busca_cadastro
		nome = params[:nome]
		@cadastro_buscado = Cadastro.where "nome like ?","%#{nome}%"
---
SELECT "cadastros".* FROM "cadastros" WHERE (nome like NULL)